&НаСервере
Процедура ВыполнитьВыгрузкуДанныхClickHouseНаСервере(СтруктураПараметрыФормы)
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	Для каждого Элемент из СтруктураПараметрыФормы Цикл
		ПараметрыОбработки.Вставить(Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
	ДанныеОбъекта = РеквизитФормыВЗначение("Объект");
	МДОбъекта = ДанныеОбъекта.Метаданные();
	Для Каждого ТекРеквизит Из МДОбъекта.Реквизиты Цикл
		ПараметрыОбработки.Вставить(ТекРеквизит.Имя,ДанныеОбъекта[ТекРеквизит.Имя]);
	КонецЦикла;
	//
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьЧтениеСохраненныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	ПриОткрытииНаСервере();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПример(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполнитьСтруктуруПараметровИзФормы("КомандаПример"));
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьСтруктуруПараметровИзФормы(ИмяТаблицы)
	СтруктураПараметрыФормы = Новый Структура;
	//СтруктураПараметрыФормы.Вставить("Адрес", Объект.Адрес);
	СтруктураПараметрыФормы.Вставить("ИмяТаблицы", ИмяТаблицы);	
	СтруктураПараметрыФормы.Вставить("ДатаНачала", Период.ДатаНачала);
	СтруктураПараметрыФормы.Вставить("ДатаОкончания", Период.ДатаОкончания);
	СтруктураПараметрыФормы.Вставить("ПроверитьТаблицу", Объект.ПроверитьТаблицу);
	
	Возврат СтруктураПараметрыФормы;
КонецФункции

&НаКлиенте
Функция ЗаполнитьСтруктуруПараметровИзФормыПоЗапросу(ПараметрТекстЗапроса)
	СтруктураПараметрыФормы = Новый Структура;
	//СтруктураПараметрыФормы.Вставить("Адрес", Объект.Адрес);
	СтруктураПараметрыФормы.Вставить("ИмяТаблицы", ?(ЗначениеЗаполнено(Объект.ИмяБазы), Объект.ИмяБазы, "ТекстЗапроса"));	
	СтруктураПараметрыФормы.Вставить("ДатаНачала", Период.ДатаНачала);
	СтруктураПараметрыФормы.Вставить("ДатаОкончания", Период.ДатаОкончания);
	СтруктураПараметрыФормы.Вставить("ПроверитьТаблицу", Объект.ПроверитьТаблицу);
	СтруктураПараметрыФормы.Вставить("ТекстЗапроса", ПараметрТекстЗапроса);
	СтруктураПараметрыФормы.Вставить("ЭтоПоЗапросу", Истина);
	
	Возврат СтруктураПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура Конструктор(Команда)

    Конструктор = Новый КонструкторЗапроса;
    Конструктор.Текст = Объект.ТекстЗапроса;
    Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтотОбъект);
    Конструктор.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт

    Если НЕ Текст = Неопределено Тогда
    	Объект.ТекстЗапроса = Текст;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)

  ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполнитьСтруктуруПараметровИзФормыПоЗапросу(Объект.ТекстЗапроса));  

КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	СамОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыОбработки = СамОбъект.ПараметрыОбработки();
	НачальныеПараметры = ПолучитьНачальныеПараметрыФормы();
	НастройкиОбработки = СамОбъект.ПолучитьНастройкиОбработки(НачальныеПараметры);
	СамОбъект.СохранитьПараметрыОбработки(ПараметрыОбработки, НастройкиОбработки);
КонецПроцедуры

&НаСервере
Функция ПолучитьНачальныеПараметрыФормы()
	
	//Результат = Новый Структура();
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры
