&НаСервере
Процедура ВыполнитьВыгрузкуДанныхClickHouseНаСервере(СтруктураПараметрыФормы)
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	Для каждого Элемент из СтруктураПараметрыФормы Цикл
		ПараметрыОбработки.Вставить(Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
	//
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПример(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы("КомандаПример"));
КонецПроцедуры

&НаКлиенте
Функция ЗаполенитьСтруктуруПараметровИзФормы(ИмяТаблицы)
	СтруктураПараметрыФормы = Новый Структура;
	//СтруктураПараметрыФормы.Вставить("Адрес", Объект.Адрес);
	СтруктураПараметрыФормы.Вставить("ИмяТаблицы", ИмяТаблицы);	
	СтруктураПараметрыФормы.Вставить("ДатаНачала", Период.ДатаНачала);
	СтруктураПараметрыФормы.Вставить("ДатаОкончания", Период.ДатаОкончания);
	СтруктураПараметрыФормы.Вставить("ПроверитьТаблицу", ПроверитьТаблицу);
	
	Возврат СтруктураПараметрыФормы;
КонецФункции

&НаКлиенте
Функция ЗаполенитьСтруктуруПараметровИзФормыПоЗапросу(ПараметрТекстЗапроса)
	СтруктураПараметрыФормы = Новый Структура;
	//СтруктураПараметрыФормы.Вставить("Адрес", Объект.Адрес);
	СтруктураПараметрыФормы.Вставить("ИмяТаблицы", "ТекстЗапроса");	
	СтруктураПараметрыФормы.Вставить("ДатаНачала", Период.ДатаНачала);
	СтруктураПараметрыФормы.Вставить("ДатаОкончания", Период.ДатаОкончания);
	СтруктураПараметрыФормы.Вставить("ПроверитьТаблицу", ПроверитьТаблицу);
	СтруктураПараметрыФормы.Вставить("ТекстЗапроса", ПараметрТекстЗапроса);
	СтруктураПараметрыФормы.Вставить("ЭтоПоЗапросу", Истина);
	
	Возврат СтруктураПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура Конструктор(Команда)

    Конструктор = Новый КонструкторЗапроса;
    Конструктор.Текст = ТекстЗапроса;
    Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтотОбъект);
    Конструктор.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт

    Если НЕ Текст = Неопределено Тогда
    	ТекстЗапроса = Текст;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)

  ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормыПоЗапросу(ТекстЗапроса));  

КонецПроцедуры
