//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним + " " + ЭтотОбъект.Метаданные().Комментарий; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета); 
	
	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", Синоним);
	РегистрационныеДанные.Вставить("Версия", "1.0.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Обработка "+Синоним); 
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, Синоним+" ручное", "Синхронизация1C_ClickHouse", "ОткрытиеФормы", Истина);
	ДобавитьКоманду(ТаблицаКоманд, Синоним+" фоновое", "Синхронизация1C_ClickHouseНаСервере" , "ВызовСерверногоМетода");
	
	// Сохраним таблицу команд в параметры регистрации обработки
	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "Синхронизация1C_ClickHouseНаСервере" Тогда  
		ПараметрыОбработки = ЗаполнитьПараметры();
		ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки);
	КонецЕсли;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ЗаполнитьПараметры() Экспорт
	ТекущаяДата = ТекущаяДата();
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Адрес", "IP");
	СтруктураПараметры.Вставить("Порт", 8123);
	СтруктураПараметры.Вставить("Логин", "default");
	СтруктураПараметры.Вставить("Пароль", "password");
	СтруктураПараметры.Вставить("ИмяБазы", "db_name");
	СтруктураПараметры.Вставить("ИмяТаблицы", "БросаниеВагоновТип");
	
	СтруктураПараметры.Вставить("ДатаНачала", ДатаДнейНазад(ТекущаяДата, 1));
	СтруктураПараметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата));
	Возврат СтруктураПараметры;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ПолучитьТаблицуКоманд()
 
     Команды = Новый ТаблицаЗначений;
     Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
     Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
     Возврат Команды;
 
 КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end
 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
 
      НоваяКоманда = ТаблицаКоманд.Добавить();
      НоваяКоманда.Представление = Представление;
      НоваяКоманда.Идентификатор = Идентификатор;
      НоваяКоманда.Использование = Использование;
      НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
      НоваяКоманда.Модификатор = Модификатор;
 
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ВыгрузитьДанныеClickHouseНаСервере(Параметры) Экспорт
	
	//
	Если Не ЕстьБазаВClickHouse(Параметры.ИмяБазы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеБазыДанных(Параметры);
		БазаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	Параметры.Вставить("ИмяТаблицыТранслит", Транслит(Параметры.ИмяТаблицы));
	Если Параметры.ИмяТаблицы = "БросаниеВагоновТип" Тогда
		ВыгрузитьДанныеClickHouse_БросаниеВагоновТип_НаСервере(Параметры);
	КонецЕсли;
	Если Параметры.ИмяТаблицы = "ЗапросОперативныйОтчетЛогисты" Тогда
		ВыгрузитьДанныеClickHouse_ОперативныйОтчетЛогисты_НаСервере(Параметры);
	КонецЕсли;
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ВыгрузитьДанныеClickHouse_ОперативныйОтчетЛогисты_НаСервере(Параметры)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Запрос"+Параметры.ИмяТаблицы);
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	//
	ПараметрыМакета = СхемаКомпоновкиДанных.Параметры;
	//
	Если Не ЕстьТаблицаВClickHouse(Параметры.ИмяТаблицы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеТаблицыБросаниеВагоновТип(Параметры);
		ТаблицаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	//
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если СтрНайти(СтрокаПараметра.Имя, "Период") > 0 Тогда
			Запрос.УстановитьПараметр(СтрокаПараметра.Имя, Параметры.ДатаНачала);
		Иначе
			Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ВключитьОтборТолькоБросание", Истина);
	//
	Если НачалоДня(Параметры.ДатаОкончания) <> НачалоДня(Параметры.ДатаНачала) Тогда
		КоличествоДней = РозностьВДнях(Параметры.ДатаОкончания, Параметры.ДатаНачала);
		НоваяДатаОтчета = НачалоДня(Параметры.ДатаНачала);
		Для Счетчик = 1 По КоличествоДней + 1 Цикл
			//
			Для каждого СтрокаПараметра из ПараметрыМакета Цикл
				Если СтрНайти(ВРег(СтрокаПараметра.Имя), ВРег("Период")) > 0 Тогда
					Запрос.УстановитьПараметр(СтрокаПараметра.Имя, НоваяДатаОтчета);
				КонецЕсли;
			КонецЦикла;
			ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, НоваяДатаОтчета);
			//
			НоваяДатаОтчета = ДатаДнейВперед(Параметры.ДатаНачала, Счетчик);
			//НоваяДатаОтчета = НачалоДня(НоваяДатаОтчета) + 60 * 60 * 24;
		КонецЦикла;
	Иначе
		ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, Параметры.ДатаНачала);
	КонецЕсли;	 
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ВыгрузитьДанныеClickHouse_БросаниеВагоновТип_НаСервере(Параметры)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Запрос"+Параметры.ИмяТаблицы);
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	//
	ПараметрыМакета = СхемаКомпоновкиДанных.Параметры;
	//
	Если Не ЕстьТаблицаВClickHouse(Параметры.ИмяТаблицы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеТаблицыБросаниеВагоновТип(Параметры);
		ТаблицаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	//
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если СтрНайти(СтрокаПараметра.Имя, "Период") > 0 Тогда
			Запрос.УстановитьПараметр(СтрокаПараметра.Имя, Параметры.ДатаНачала);
		Иначе
			Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ВключитьОтборТолькоБросание", Истина);
	//
	Если НачалоДня(Параметры.ДатаОкончания) <> НачалоДня(Параметры.ДатаНачала) Тогда
		КоличествоДней = РозностьВДнях(Параметры.ДатаОкончания, Параметры.ДатаНачала);
		НоваяДатаОтчета = НачалоДня(Параметры.ДатаНачала);
		Для Счетчик = 1 По КоличествоДней + 1 Цикл
			//
			Для каждого СтрокаПараметра из ПараметрыМакета Цикл
				Если СтрНайти(ВРег(СтрокаПараметра.Имя), ВРег("Период")) > 0 Тогда
					Запрос.УстановитьПараметр(СтрокаПараметра.Имя, НоваяДатаОтчета);
				КонецЕсли;
			КонецЦикла;
			ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, НоваяДатаОтчета);
			//
			НоваяДатаОтчета = ДатаДнейВперед(Параметры.ДатаНачала, Счетчик);
			//НоваяДатаОтчета = НачалоДня(НоваяДатаОтчета) + 60 * 60 * 24;
		КонецЦикла;
	Иначе
		ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, Параметры.ДатаНачала);
	КонецЕсли;	 
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ДатаДнейВперед(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) + 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ДатаДнейНазад(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) - 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция РозностьВДнях(ДатаОкончания, ДатаНачала)
	Возврат (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, ПериодДата)
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	//
	ВыборкаРезультата = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Для каждого СтрокаР из ВыборкаРезультата Цикл
		ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата);	
	КонецЦикла;
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата)
	Если Параметры.ИмяТаблицы = "БросаниеВагоновТип" Тогда
		ВставитьЗаписьВClickHouse_БросаниеВагоновТип(СтрокаР, Параметры, ПериодДата);
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Процедура ВставитьЗаписьВClickHouse_БросаниеВагоновТип(СтрокаР, Параметры, ПериодДата)
	МассивПолей = ВернутьМассивПорядокПолейВClickHouse_БросаниеВагоновТип();
	КоличествоПолей = МассивПолей.Количество();
	Счетчик = 0;
	ТекстЗапроса = "INSERT INTO " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " (*)";
	ТекстЗапросаПоля = "VALUES (";
	Для каждого СтрокаП из МассивПолей Цикл
		Счетчик = Счетчик + 1;
		ЗначениеПоля = Строка(СтрокаР[СтрокаП]);
		Если СтрНайти(ВРег(СтрокаП), ВРег("Период")) > 0 Тогда
			//ЗначениеПоля = ПолучитьUnixTS(НачалоДня(СтрокаР[СтрокаП]));
			ЗначениеПоля = ПолучитьВремяUTC(ПериодДата);
			//ЗначениеПоля = ПолучитьВремяUTC(НачалоДня(СтрокаР[СтрокаП]));
		КонецЕсли;
		Если СтрНайти(ВРег(СтрокаП), ВРег("Дата")) > 0 Тогда
			//ЗначениеПоля = ПолучитьUnixTS(СтрокаР[СтрокаП]);
			ЗначениеПоля = ПолучитьВремяUTC(СтрокаР[СтрокаП]);
		КонецЕсли;
		Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Число") Тогда
			ЗначениеПоля = СокрЛП(СтрокаР[СтрокаП]);
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ",", ".");
		КонецЕсли;
		Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Строка") Тогда
			ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
		КонецЕсли;
		ТекстЗапросаПоля = ТекстЗапросаПоля + ЗначениеПоля;
		Если Счетчик <> КоличествоПолей Тогда
			ТекстЗапросаПоля = ТекстЗапросаПоля + ",";	
		КонецЕсли;
	КонецЦикла;
	ТекстЗапросаПоля = ТекстЗапросаПоля + ")";
	Ошибка = "";
	РезультатВыполненияЗапроса = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса + " " + ТекстЗапросаПоля, Параметры);
	Ошибка = "";
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ПолучитьВремяUTC(ПараметрДата) 
	ПериодДень = День(ПараметрДата);
	ПериодМесяц = Месяц(ПараметрДата);
	ПериодГод = Год(ПараметрДата);
	ПериодЧас = Час(ПараметрДата);
	ПериодМинута = Минута(ПараметрДата);
	ПериодСекунда = Секунда(ПараметрДата);
	Возврат "'" + ВернутьЧислоБезПробелов(ПериодГод) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодМесяц) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодДень) + " " + ВернутьЧислоБезПробеловСНулями(ПериодЧас) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодМинута) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодСекунда) + "'"; 
КонецФункции 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ПолучитьUnixTS(ПараметрДата) 
	Возврат ВернутьЧислоБезПробелов(УниверсальноеВремя(ПараметрДата) - '19700101'); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВернутьЧислоБезПробелов(ЧислоИзСтроки)
	Возврат Формат(ЧислоИзСтроки, "ЧН=0; ЧГ=0"); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВернутьЧислоБезПробеловСНулями(ЧислоИзСтроки)
	Возврат Формат(ЧислоИзСтроки, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВернутьМассивПорядокПолейВClickHouse_БросаниеВагоновТип()
	М = Новый Массив;
	М.Добавить("Период");
	М.Добавить("РПС");
	М.Добавить("ТипСобственности");
	М.Добавить("НомерКонтейнера");
	М.Добавить("стДислокации");
	М.Добавить("ДатаОперации");
	М.Добавить("ДнейБезДвижения");
	М.Добавить("КоличествоТС");
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ЕстьБазаВClickHouse(ИмяБазы, Параметры)
	Запрос = "SELECT name, comment FROM system.databases WHERE name = '" + Параметры.ИмяБазы + "';";
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+Запрос);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ТекстЗапросаСозданиеБазыДанных(Параметры)
	Возврат "CREATE DATABASE " + Параметры.ИмяБазы + " ENGINE = Memory COMMENT 'The Metrics database';";
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ТекстЗапросаСозданиеТаблицыБросаниеВагоновТип(Параметры)
	Возврат "CREATE TABLE " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + "
	|(	Period Datetime,
	|	Type String,
	|	PropertyType String,
	|	Number String,
	|	Station String,
	|	Date Datetime,
	|	Days Decimal64(10),
	|	Count UInt32
	|)
	|ENGINE = ReplacingMergeTree
	|PRIMARY KEY (Period, Number)";
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры)
	Запрос = ТекстЗапроса;
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	ФайлЗапроса = ПолучитьИмяВременногоФайла();
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.УстановитьТекст(Запрос);
	ТекстовыйФайл.Записать(ФайлЗапроса,КодировкаТекста.UTF8);
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.УстановитьИмяФайлаТела(ФайлЗапроса);
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "OK") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ЕстьТаблицаВClickHouse(ИмяТаблицы, Параметры)
	Запрос = "SELECT * FROM " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " LIMIT 1;";
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+Запрос);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция ЭтоОшибкаЗапросаClickHouse(ТекстОтвета)
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 57") Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 62") Тогда
		Возврат Истина; 
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 60") Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 36") Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
Функция Транслит(Строка) 
    
   Рез = СокрЛП(Строка);   
   Рез = СтрЗаменить(Рез,"а","a"); 
   Рез = СтрЗаменить(Рез,"б","b"); 
   Рез = СтрЗаменить(Рез,"в","v"); 
   Рез = СтрЗаменить(Рез,"г","g"); 
   Рез = СтрЗаменить(Рез,"д","d"); 
   Рез = СтрЗаменить(Рез,"е","e"); 
   Рез = СтрЗаменить(Рез,"ё","e"); 
   Рез = СтрЗаменить(Рез,"ж","zh"); 
   Рез = СтрЗаменить(Рез,"з","z"); 
   Рез = СтрЗаменить(Рез,"и","i"); 
   Рез = СтрЗаменить(Рез,"к","k"); 
   Рез = СтрЗаменить(Рез,"л","l"); 
   Рез = СтрЗаменить(Рез,"м","m"); 
   Рез = СтрЗаменить(Рез,"н","n"); 
   Рез = СтрЗаменить(Рез,"о","o"); 
   Рез = СтрЗаменить(Рез,"п","p"); 
   Рез = СтрЗаменить(Рез,"р","r"); 
   Рез = СтрЗаменить(Рез,"с","s"); 
   Рез = СтрЗаменить(Рез,"т","t"); 
   Рез = СтрЗаменить(Рез,"у","u"); 
   Рез = СтрЗаменить(Рез,"ф","f"); 
   Рез = СтрЗаменить(Рез,"х","h"); 
   Рез = СтрЗаменить(Рез,"ч","ch"); 
   Рез = СтрЗаменить(Рез,"ш","sh"); 
   Рез = СтрЗаменить(Рез,"щ","sch"); 
   Рез = СтрЗаменить(Рез,"ъ",""); 
   Рез = СтрЗаменить(Рез,"ь",""); 
   Рез = СтрЗаменить(Рез,"э","e"); 
   Рез = СтрЗаменить(Рез,"ю","yu"); 
   Рез = СтрЗаменить(Рез,"й","i"); 
   Рез = СтрЗаменить(Рез,"ц","c"); 
   Рез = СтрЗаменить(Рез,"я","ya"); 
   Рез = СтрЗаменить(Рез,"ы","i"); 
   Рез = СтрЗаменить(Рез,"А","A"); 
   Рез = СтрЗаменить(Рез,"Б","B"); 
   Рез = СтрЗаменить(Рез,"В","V"); 
   Рез = СтрЗаменить(Рез,"Г","G"); 
   Рез = СтрЗаменить(Рез,"Д","D"); 
   Рез = СтрЗаменить(Рез,"Е","E"); 
   Рез = СтрЗаменить(Рез,"Ё","E"); 
   Рез = СтрЗаменить(Рез,"Ж","ZH"); 
   Рез = СтрЗаменить(Рез,"З","Z"); 
   Рез = СтрЗаменить(Рез,"И","I"); 
   Рез = СтрЗаменить(Рез,"К","K"); 
   Рез = СтрЗаменить(Рез,"Л","L"); 
   Рез = СтрЗаменить(Рез,"М","M"); 
   Рез = СтрЗаменить(Рез,"Н","N"); 
   Рез = СтрЗаменить(Рез,"О","O"); 
   Рез = СтрЗаменить(Рез,"П","P"); 
   Рез = СтрЗаменить(Рез,"Р","R"); 
   Рез = СтрЗаменить(Рез,"С","S"); 
   Рез = СтрЗаменить(Рез,"Т","T"); 
   Рез = СтрЗаменить(Рез,"У","U"); 
   Рез = СтрЗаменить(Рез,"Ф","F"); 
   Рез = СтрЗаменить(Рез,"Х","H"); 
   Рез = СтрЗаменить(Рез,"Ч","CH"); 
   Рез = СтрЗаменить(Рез,"Ш","SH"); 
   Рез = СтрЗаменить(Рез,"Щ","SCH"); 
   Рез = СтрЗаменить(Рез,"Ъ",""); 
   Рез = СтрЗаменить(Рез,"Ь",""); 
   Рез = СтрЗаменить(Рез,"Ы","I"); 
   Рез = СтрЗаменить(Рез,"Ц","C"); 
   Рез = СтрЗаменить(Рез,"Э","E"); 
   Рез = СтрЗаменить(Рез,"Ю","YU"); 
   Рез = СтрЗаменить(Рез,"Я","YA"); 
   Рез = СтрЗаменить(Рез,"Й","I");
   
   Рез = СтрЗаменить(Рез," ","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"#",""); 
   Рез = СтрЗаменить(Рез,"№",""); 
   Рез = СтрЗаменить(Рез,",",""); 
   Рез = СтрЗаменить(Рез,".",""); 
   Рез = СтрЗаменить(Рез,"/",""); 
   Рез = СтрЗаменить(Рез,"""",""); 
   Рез = СтрЗаменить(Рез,"(",""); 
   Рез = СтрЗаменить(Рез,")",""); 
   
   Возврат(Рез);
  
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

