//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним + " " + ЭтотОбъект.Метаданные().Комментарий; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета); 
	
	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", Синоним);
	РегистрационныеДанные.Вставить("Версия", "1.1.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Обработка "+Синоним); 
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, Синоним+" ручное", "Синхронизация1C_ClickHouse", "ОткрытиеФормы", Истина);
	ДобавитьКоманду(ТаблицаКоманд, "БросаниеВагоновТип фоновое", "Синхронизация1C_ClickHouseНаСервере_БросаниеВагоновТип" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетЛогисты фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетЛогисты" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКоммерсанты фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКоммерсанты" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОтчетСтранныеДвижения фоновое", "Синхронизация1C_ClickHouseНаСервере_ОтчетСтранныеДвижения" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОтчетПоЭкономикеИСтатистикеРейсов фоновое", "Синхронизация1C_ClickHouseНаСервере_ОтчетПоЭкономикеИСтатистикеРейсов" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентаВагоныАсбест фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентаВагоныАсбест" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентаВагоныАсбестV2 фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентаВагоныАсбестV2" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентаВагоныДжабыкV2 фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентаВагоныДжабыкV2" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентаВагоныАсбестV28 фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентаВагоныАсбестV28" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентаВагоныДжабыкV28 фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентаВагоныДжабыкV28" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОтчетДислокацииДляЛогистаИМенеджера фоновое", "Синхронизация1C_ClickHouseНаСервере_ОтчетДислокацииДляЛогистаИМенеджера" , "ВызовСерверногоМетода");
	//
	ДобавитьКоманду(ТаблицаКоманд, "ЗапросПростоиИБросаниеНеНаСтанцииДиспетчерKPI фоновое", "Синхронизация1C_ClickHouseНаСервере_ЗапросПростоиИБросаниеНеНаСтанцииДиспетчерKPI" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ЗапросПростоиИБросаниеНаСтанцииДиспетчерKPI фоновое", "Синхронизация1C_ClickHouseНаСервере_ЗапросПростоиИБросаниеНаСтанцииДиспетчерKPI" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ЗапросПростоиИБросаниеДиспетчерKPI фоновое", "Синхронизация1C_ClickHouseНаСервере_ЗапросПростоиИБросаниеДиспетчерKPI" , "ВызовСерверногоМетода");
	//
	ДобавитьКоманду(ТаблицаКоманд, "ДислокацияВагонов фоновое", "Синхронизация1C_ClickHouseНаСервере_ДислокацияВагонов" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ДислокацияВагоновСрезПоследних фоновое", "Синхронизация1C_ClickHouseНаСервере_ДислокацияВагоновСрезПоследних" , "ВызовСерверногоМетода");
	
	// Сохраним таблицу команд в параметры регистрации обработки
	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start	 
Функция ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт
	
	МассивПодстроки = СтрРазделить(ИдентификаторКоманды, "_");
	Если МассивПодстроки[1] = "ClickHouseНаСервере" Тогда  
		ПараметрыОбработки = ЗаполнитьПараметры();
		ПараметрыОбработки.Вставить("ИмяТаблицы", МассивПодстроки[2]);
		ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки, МассивПодстроки);
	КонецЕсли;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start
Функция ЗаполнитьПараметры() Экспорт
	ТекущаяДата = ТекущаяДата();
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Адрес", "IP");
	СтруктураПараметры.Вставить("Порт", 8123);
	СтруктураПараметры.Вставить("Логин", "default");
	СтруктураПараметры.Вставить("Пароль", "password");
	СтруктураПараметры.Вставить("ИмяБазы", "db_name");
	СтруктураПараметры.Вставить("ИмяТаблицы", "БросаниеВагоновТип");
	
	СтруктураПараметры.Вставить("ДатаНачала", ДатаДнейНазад(ТекущаяДата, 1));
	СтруктураПараметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата));
	Возврат СтруктураПараметры;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start										   
Функция ПолучитьТаблицуКоманд()
 
     Команды = Новый ТаблицаЗначений;
     Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
     Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
     Возврат Команды;
 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end
 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																					 
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
 
      НоваяКоманда = ТаблицаКоманд.Добавить();
      НоваяКоманда.Представление = Представление;
      НоваяКоманда.Идентификатор = Идентификатор;
      НоваяКоманда.Использование = Использование;
      НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
      НоваяКоманда.Модификатор = Модификатор;
 
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start 
Процедура ВыгрузитьДанныеClickHouseНаСервере(Параметры, МассивПодстроки = Неопределено) Экспорт
	
	//
	Если Не ЕстьБазаВClickHouse(Параметры.ИмяБазы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеБазыДанных(Параметры);
		БазаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	Параметры.Вставить("ИмяТаблицыТранслит", Транслит(Параметры.ИмяТаблицы));
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start		  
	//
	ПараметрыЗапроса = ПолучитьСтруктуруПараметровЗапроса(Параметры);
	//
	Если Не ЕстьТаблицаВClickHouse(Параметры.ИмяТаблицы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеТаблицыПериодСхемаКомпоновкиДанных(Параметры, ПараметрыЗапроса.ПараметрыМакета, ПараметрыЗапроса.ПоляНабораДанных, ПараметрыЗапроса.МассивПолейКлючейПериод);
		ТаблицаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 start
	ОписаниеТаблицыClickHouse = ОписаниеТаблицыВClickHouse(Параметры.ИмяТаблицы, Параметры);
	Параметры.Вставить("ОписаниеТаблицыClickHouse", ОписаниеТаблицыClickHouse);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 end
	//
	Если Параметры.ИмяТаблицы = "БросаниеВагоновТип" Тогда
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		//
		Запрос.УстановитьПараметр("ВключитьОтборТолькоБросание", Истина);
		//
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);
	Иначе
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);	
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																					

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start										   
Функция ПолучитьКлючиClickHouse_ОперативныйОтчетЛогисты()
	М = Новый Массив;
	М.Добавить("Период");
	М.Добавить("СтанцияОтправленияНаименование");
	М.Добавить("ТипТСНаименование");
	М.Добавить("ТипФильтра");
	М.Добавить("СтанцияНазначения");
	М.Добавить("ГрузополучательНаименование");
	М.Добавить("СтанцияНазначенияНаименование");
	М.Добавить("НомерКонтейнера");
	М.Добавить("ГрузоотправительКодПоОКПО");
	М.Добавить("ОператорПоДоверенности");
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 9:30 start
Функция ДатаСУчетомПериодичности(Дата, Периодичность, ЭтоНачало = Истина)
	Если Периодичность = "Месяц" Тогда
		Если ЭтоНачало Тогда
			Возврат НачалоМесяца(Дата);
		Иначе
			Возврат КонецМесяца(Дата);
		КонецЕсли;
	ИначеЕсли Периодичность = "День" Тогда
		Если ЭтоНачало Тогда
			Возврат НачалоДня(Дата);
		Иначе
			Возврат КонецДня(Дата);
		КонецЕсли;
	Иначе
		Если ЭтоНачало Тогда
			Возврат НачалоМесяца(Дата);
		Иначе
			Возврат КонецМесяца(Дата);
		КонецЕсли;
	КонецЕсли;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start									   
Функция ВернутьДату_Запрос_НаСервере(ИмяПоля, ПериодОтчета, НоваяДатаОтчета, Периодичность)
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start																				 
	Если ИмяПоля = "ДатаОтчетаСутки1" Тогда
		Возврат НачалоДня(ДатаДнейНазад(ПериодОтчета, 1));
	КонецЕсли;
	Если ИмяПоля = "ДатаОтчетаСутки2" Тогда
		Возврат КонецДня(ДатаДнейНазад(ПериодОтчета, 1));
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end																			   
	Если ИмяПоля = "Дата1" Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Истина);
	КонецЕсли;
	Если ИмяПоля = "Дата2" Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Ложь);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчета" Тогда
		Возврат ПериодОтчета;
	КонецЕсли;
	Если ИмяПоля = "Период" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start																				 
	Если ИмяПоля = "ДатаОтчетаВывод" Тогда
		Возврат Формат(НачалоДня(ПериодОтчета), "ДФ=dd.MM.yyyy");
	КонецЕсли;
	Если ИмяПоля = "ДатаОтчета" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ПериодОтчета" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ПериодДень1" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ПериодДень2" Тогда
		Возврат КонецДня(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "КонецОтчета" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end																			   
	Если ИмяПоля = "ДатаПланНачало" Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаПланКонец" Тогда
		Возврат КонецДня(ДатаДнейНазад(ПериодОтчета, 1));
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетБаланс" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start																				 
	Если ИмяПоля = "ТекущаяДата" Тогда
		Возврат НачалоДня(НоваяДатаОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end																			   
	Если ИмяПоля = "ТекущаяДатаОтчетЗаказ" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетПоОперациямОтбор" Тогда
		Возврат НачалоДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправление3" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправлениеТолько" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправлениеНазначение3" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаДислокацияПогружено1" Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаДислокацияПогружено2" Тогда
		Возврат КонецМесяца(ПериодОтчета);
	КонецЕсли;
	
	
	Если СтрНайти(ИмяПоля, "Период") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Текущая") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Дата1") > 0 Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Истина);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Начало") > 0 Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Истина);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Дата2") > 0 Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Ложь);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Конец") > 0 Тогда
		Возврат ДатаСУчетомПериодичности(ПериодОтчета, Периодичность, Ложь);
	КонецЕсли;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start			   
Функция ПолучитьСтруктуруПараметровЗапроса(Параметры)
	СтандартнаяОбработка = Ложь;
	ДополнитеьныеПараметры = Новый Структура;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Запрос"+Параметры.ИмяТаблицы);
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	//
	ПараметрыМакета = СхемаКомпоновкиДанных.Параметры;
	ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	МассивПолей = ВернутьМассивПорядокПериодИзНабораДанных(ПоляНабораДанных);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start		  
	МассивПолейКлючейПериод = ВернутьМассивПолейКлючейПериодИзНабораДанных(ПоляНабораДанных);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 start
	Если НачалоДня(Параметры.ДатаНачала) <> НачалоДня(Параметры.ДатаОкончания) Тогда
		ДополнитеьныеПараметры.Вставить("КоличествоДнейНазад", РозностьВДнях(Параметры.ДатаОкончания, Параметры.ДатаНачала));	
	Иначе
		ДополнитеьныеПараметры.Вставить("КоличествоДнейНазад", ПолучитьПараметрМакетаПоИмени("КоличествоДнейНазад", ПараметрыМакета));
	КонецЕсли;
	
	ДополнитеьныеПараметры.Вставить("КоличествоВПортиции", ПолучитьПараметрМакетаПоИмени("КоличествоВПортиции", ПараметрыМакета));
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 end
	//
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2024 18:00 start
	ДополнитеьныеПараметры.Вставить("ОднимФайлом", ПолучитьПараметрМакетаПоИмени("ОднимФайлом", ПараметрыМакета));
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2024 18:00 end
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 18:00 start
	ДополнитеьныеПараметры.Вставить("Периодичность", ПолучитьПараметрМакетаПоИмени("Периодичность", ПараметрыМакета));
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 18:00 end
	
	Возврат Новый Структура("Запрос, ПараметрыМакета, ПоляНабораДанных, МассивПолей, МассивПолейКлючейПериод, ДополнитеьныеПараметры", Запрос, ПараметрыМакета, ПоляНабораДанных, МассивПолей, МассивПолейКлючейПериод, ДополнитеьныеПараметры);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end		 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start									
Функция ПолучитьПараметрМакетаПоИмени(ИмяПараметра, ПараметрыМакета)
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если СтрокаПараметра.Имя = ИмяПараметра Тогда
			Возврат СтрокаПараметра.Значение;
		КонецЕсли;
	КонецЦикла; 
	Если ИмяПараметра = "КоличествоДнейНазад" Тогда
		Возврат 1;
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 start
	Если ИмяПараметра = "КоличествоВПортиции" Тогда
		Возврат 1000;
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 end
	//
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2024 18:00 start	
	Если ИмяПараметра = "ОднимФайлом" Тогда
		Возврат Истина;
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2024 18:00 end
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 18:00 start	
	Если ИмяПараметра = "Периодичность" Тогда
		Возврат "Месяц";
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 28-03-2024 18:00 end
	Возврат Неопределено;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start										
Функция УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса)
	
	Запрос = ПараметрыЗапроса.Запрос;
	ПараметрыМакета = ПараметрыЗапроса.ПараметрыМакета;
	ПоляНабораДанных = ПараметрыЗапроса.ПоляНабораДанных;
	МассивПолей = ПараметрыЗапроса.МассивПолей;
	ДополнитеьныеПараметры = ПараметрыЗапроса.ДополнитеьныеПараметры;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start	  
	МассивПолейКлючейПериод = ПараметрыЗапроса.МассивПолейКлючейПериод;
	//
	Если Не ЕстьТаблицаВClickHouse(Параметры.ИмяТаблицы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеТаблицыПериодСхемаКомпоновкиДанных(Параметры, ПараметрыМакета, ПоляНабораДанных, МассивПолейКлючейПериод);
		ТаблицаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	//
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если ТипЗнч(СтрокаПараметра.ТипЗначения) = Тип("ОписаниеТипов") Тогда
			Если Строка(СтрокаПараметра.ТипЗначения) = "Стандартный период" Тогда				
				ДатаНачала = ВернутьДату_Запрос_НаСервере("Начало", Параметры.ДатаНачала, Параметры.ДатаНачала, ДополнитеьныеПараметры.Периодичность);
				ДатаОкончания = ВернутьДату_Запрос_НаСервере("Конец", Параметры.ДатаНачала, Параметры.ДатаНачала, ДополнитеьныеПараметры.Периодичность);
                СтрокаПараметра.Значение = Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
			ИначеЕсли Строка(СтрокаПараметра.ТипЗначения) = "Дата" Тогда
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, ВернутьДату_Запрос_НаСервере(СтрокаПараметра.Имя, Параметры.ДатаНачала, Параметры.ДатаНачала, ДополнитеьныеПараметры.Периодичность));
			Иначе
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
	Возврат Запрос;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 start
Функция СтрРазделитьРасширенная(Строка, Разделитель = ",", ВключатьПустые = Истина,
	СокращатьНепечатаемыеСимволы = Ложь, РазделительЕдинойСтрокой = Истина) Экспорт

	Если РазделительЕдинойСтрокой И СтрДлина(Разделитель) > 1 Тогда

		Результат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Строка, Разделитель, НЕ ВключатьПустые, СокращатьНепечатаемыеСимволы);

	Иначе

		Результат = СтрРазделить(Строка, Разделитель, ВключатьПустые);
		Если СокращатьНепечатаемыеСимволы Тогда
			Для Индекс = 0 По Результат.Количество()-1 Цикл
				Результат[Индекс] = СокрЛП(Результат[Индекс]);
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;        

	Возврат Результат;

КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start									  
Процедура ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса)
	
	ПараметрыМакета = ПараметрыЗапроса.ПараметрыМакета;
	ПоляНабораДанных = ПараметрыЗапроса.ПоляНабораДанных;
	МассивПолей = ПараметрыЗапроса.МассивПолей;
	ДополнитеьныеПараметры = ПараметрыЗапроса.ДополнитеьныеПараметры;
	//
	Если ДополнитеьныеПараметры.КоличествоДнейНазад > 0 Тогда

		НоваяДатаОтчета = НачалоДня(Параметры.ДатаНачала);
		Для Счетчик = 1 По ДополнитеьныеПараметры.КоличествоДнейНазад + 1 Цикл
			//
			Для каждого СтрокаПараметра из ПараметрыМакета Цикл
				Если ТипЗнч(СтрокаПараметра.ТипЗначения) = Тип("ОписаниеТипов") Тогда
					Если Строка(СтрокаПараметра.ТипЗначения) = "Стандартный период" Тогда
						ДатаНачала = ВернутьДату_Запрос_НаСервере("Начало", НоваяДатаОтчета, НоваяДатаОтчета, ДополнитеьныеПараметры.Периодичность);
						ДатаОкончания = ВернутьДату_Запрос_НаСервере("Конец", НоваяДатаОтчета, НоваяДатаОтчета, ДополнитеьныеПараметры.Периодичность);
                        СтрокаПараметра.Значение = Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
						Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
					ИначеЕсли Строка(СтрокаПараметра.ТипЗначения) = "Дата" Тогда
						Запрос.УстановитьПараметр(СтрокаПараметра.Имя, ВернутьДату_Запрос_НаСервере(СтрокаПараметра.Имя, НоваяДатаОтчета, НоваяДатаОтчета, ДополнитеьныеПараметры.Периодичность));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, НоваяДатаОтчета, ПоляНабораДанных, МассивПолей, ДополнитеьныеПараметры);
			//
			НоваяДатаОтчета = ДатаДнейВперед(НоваяДатаОтчета, 1);
		КонецЦикла;
	Иначе
		ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, Параметры.ДатаНачала, ПоляНабораДанных, МассивПолей, ДополнитеьныеПараметры);
	КонецЕсли;	 
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start											  
Функция ДатаДнейВперед(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) + 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start									
Функция ДатаДнейНазад(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) - 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start										
Функция РозностьВДнях(ДатаОкончания, ДатаНачала)
	Возврат (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																						 
Процедура ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, ПериодДата, ПоляНабораДанных = Неопределено, МассивПолей = Неопределено, ДополнитеьныеПараметры = Неопределено, ВходнаяТЗ = Неопределено, МассивПолейЗапрос = Неопределено, ИндексацияТЗ = Неопределено, ЕстьРазница = Неопределено)
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 start
	Если ВходнаяТЗ = Неопределено Тогда
		РезультатЗапроса = Запрос.Выполнить();
		МассивПолейЗапрос = ВернутьМассивПорядокПериодИзРезультатаЗапроса(РезультатЗапроса);
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если МассивПолейЗапрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	Если ВходнаяТЗ = Неопределено Тогда
		ВыборкаРезультата = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);	
	Иначе
		ВыборкаРезультата = ВходнаяТЗ.Скопировать();	
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 end
	//
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 start
	РезультатИндексацииПоСКД = ВернутьИндекациюПоСКДОписаниеТаблицыClickHouse(Параметры.ОписаниеТаблицыClickHouse, МассивПолейЗапрос);
	ИндексацияТЗ = РезультатИндексацииПоСКД.ИндексацияТЗ;
	ЕстьРазница = РезультатИндексацииПоСКД.ЕстьРазница;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 end
	//
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 start
	КоличествоСтрокМаксЗаРаз = ДополнитеьныеПараметры.КоличествоВПортиции;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 end
	Если ДополнитеьныеПараметры.ОднимФайлом Тогда
		СтрокиТекстаЗапроса = "";
		КоличествоСтрокОбработано = 0;
		ТекстЗапроса = "INSERT INTO " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " (*)";
		ЗначенияЗапроса = "";
		КоличествоЗаписей = ВыборкаРезультата.Количество();
		ИндексЗаписи = 0;
		Для каждого СтрокаР из ВыборкаРезультата Цикл
			КоличествоСтрокОбработано = КоличествоСтрокОбработано + 1;
			ИндексЗаписи = ИндексЗаписи + 1;
			Если КоличествоСтрокОбработано = КоличествоСтрокМаксЗаРаз ИЛИ ИндексЗаписи = КоличествоЗаписей Тогда
				ЗначенияЗапроса = ЗначенияЗапроса + ВернутьЗначенияЗапрос(СтрокаР, Параметры, ПериодДата, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница);
				РезультатВыполненияЗапроса = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса + " VALUES " + ЗначенияЗапроса + ";", Параметры);
				КоличествоСтрокОбработано = 0;
				ЗначенияЗапроса = "";
			Иначе
				ЗначенияЗапроса = ЗначенияЗапроса + ВернутьЗначенияЗапрос(СтрокаР, Параметры, ПериодДата, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница);
				ЗначенияЗапроса = ЗначенияЗапроса + "," + Символы.ПС;		
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 start
		ТЗ = Новый ТаблицаЗначений;
		Счетчик = 0;
		СчетчикИтераций = 0;
		Для каждого СтрокаР из ВыборкаРезультата Цикл
			Счетчик = Счетчик + 1;
			Если Счетчик >= КоличествоСтрокМаксЗаРаз Тогда
				СчетчикИтераций = СчетчикИтераций + 1;
				ДополнитеьныеПараметры.Вставить("СчетчикИтераций", СчетчикИтераций);
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаР);
				//
				//Выполнить фоновое задание и передать значения
				//
				ЗапуститьФоновоеЗаданиеClickHouse(Параметры, ПериодДата, МассивПолей, ДополнитеьныеПараметры, ТЗ, МассивПолейЗапрос, РезультатИндексацииПоСКД);
				//Сбросить ТЗ и счетчики
				ТЗ = Новый ТаблицаЗначений;
				Счетчик = 0;
				//
			Иначе
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаР);
			КонецЕсли;
			//ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос);
		КонецЦикла;
		//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 end
	КонецЕсли;
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 start
Функция ВернутьИндекациюПоСКДОписаниеТаблицыClickHouse(ТЗ, МассивПолейЗапрос)
	Результат = Новый Структура("ИндексацияТЗ, ЕстьРазница", ТЗ, Ложь);
	//
	Если ТЗ.Количество() <> МассивПолейЗапрос.Количество() Тогда
		Результат.Вставить("ЕстьРазница", Истина);	
	КонецЕсли;
	//
	Индекс = 0;
	Для каждого СтрокаМ из МассивПолейЗапрос Цикл
		ТранслитСтрокаМ = Транслит(СтрокаМ);
		НайденнаяСтрока = ТЗ.Найти(ТранслитСтрокаМ, "Имя");
		Если НайденнаяСтрока = Неопределено Тогда 
	    	Результат.Вставить("ЕстьРазница", Истина);	 
		Иначе
			НайденнаяСтрока.ИмяСКД = СтрокаМ;
			НайденнаяСтрока.ИндексСКД = Индекс;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	//
	Результат.Вставить("ИндексацияТЗ", ТЗ);
	Возврат Результат;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 19:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 start																						 
Процедура ЗаписатьРезультатЗапросаClickHouseФоновоеЗадание(ПараметрыЗапуска = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Запрос = ПараметрыЗапуска.Запрос;
	Параметры = ПараметрыЗапуска.Параметры;
	ПериодДата = ПараметрыЗапуска.ПериодДата;
	ПоляНабораДанных = ПараметрыЗапуска.ПоляНабораДанных;
	МассивПолей = ПараметрыЗапуска.МассивПолей;
	ДополнитеьныеПараметры = ПараметрыЗапуска.ДополнитеьныеПараметры;
	ВходнаяТЗ = ПараметрыЗапуска.ВходнаяТЗ;
	МассивПолейЗапрос = ПараметрыЗапуска.МассивПолейЗапрос;
	ИндексацияТЗ = ПараметрыЗапуска.ИндексацияТЗ;
	ЕстьРазница = ПараметрыЗапуска.ЕстьРазница;
	
	ЗаписатьРезультатЗапросаClickHouseНаСервере(
		Запрос, 
		Параметры, 
		ПериодДата, 
		ПоляНабораДанных, 
		МассивПолей, 
		ДополнитеьныеПараметры, 
		ВходнаяТЗ, 
		МассивПолейЗапрос,
		ИндексацияТЗ,
		ЕстьРазница);
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 start
Процедура ЗапуститьФоновоеЗаданиеClickHouse(Параметры, ПериодДата, МассивПолей = Неопределено, ДополнитеьныеПараметры = Неопределено, ВходнаяТЗ = Неопределено, МассивПолейЗапрос = Неопределено, ИндексацияТЗ = Неопределено, ЕстьРазница = Неопределено)
	ДополнитеьныеПараметры.Вставить("ОднимФайлом", Истина);
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	//
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Запрос", Неопределено);
	ПараметрыЗапуска.Вставить("Параметры", Параметры);
	ПараметрыЗапуска.Вставить("ПериодДата", ПериодДата);
	ПараметрыЗапуска.Вставить("ПоляНабораДанных", Неопределено);
	ПараметрыЗапуска.Вставить("МассивПолей", МассивПолей);
	ПараметрыЗапуска.Вставить("СчетчикИтераций", ДополнитеьныеПараметры.СчетчикИтераций);
	ПараметрыЗапуска.Вставить("ДополнитеьныеПараметры", ДополнитеьныеПараметры);
	ПараметрыЗапуска.Вставить("ВходнаяТЗ", ВходнаяТЗ);
	ПараметрыЗапуска.Вставить("МассивПолейЗапрос", МассивПолейЗапрос);
	ПараметрыЗапуска.Вставить("ИндексацияТЗ", ИндексацияТЗ);
	ПараметрыЗапуска.Вставить("ЕстьРазница", ЕстьРазница);
	//
    //ПараметрыЗапуска.Вставить("ТекущийПользователь", ПолучитьТекущийПользователь());
    
    СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
    
    //ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    //ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
    // указываем интервал обновления состояния в секундах, если не указать, 
    // то интервал будет увеличиваться при каждой итерации в 1.4 раза.
    //ПараметрыОжидания.Интервал = 10;
    
    //ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыыОжидания);
        
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 start
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	СтрокаНаименование = "Фоновое задание длительной: Синхронизация1C_ClickHouse" + ПараметрыЗапуска.СчетчикИтераций;
	
    НаименованиеЗадания = НСтр("ru = '" + СтрокаНаименование + "'");
    
    ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
    
    ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки", ЭтотОбъект.ИспользуемоеИмяФайла);
    ПараметрыЗадания.Вставить("ИмяМетода", "ЗаписатьРезультатЗапросаClickHouseФоновоеЗадание");
    ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыЗапуска);
    ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Истина);
    ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",Неопределено);
    
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
    ПараметрыВыполнения.ЗапуститьВФоне = Истина;
    ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
    
    СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
    
    Возврат СтруктураФоновогоЗадания;
    
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 16-01-2023 18:00 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 05-11-2023 9:30 start
Функция ВернутьЗначенияЗапрос(СтрокаР, Параметры, ПериодДата, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница)
	Счетчик = 0;
	//КоличествоПолей = МассивПолейЗапрос.Количество();
	КоличествоПолей = ИндексацияТЗ.Количество();
	ТекстЗапросаПоля = "(";
	Для каждого СтрокаТЗ из ИндексацияТЗ Цикл
		Счетчик = Счетчик + 1;
		ЗначениеПоля = Неопределено;
		Если СтрокаТЗ.ИндексСКД < 0 Тогда
			ЗначениеПоля = "'0'";		
		Иначе
			СтрокаП = МассивПолейЗапрос[СтрокаТЗ.ИндексСКД];
			Если ВРег(СтрокаП) = ВРег("Период") > 0 Тогда
				ЗначениеПоля = ПолучитьВремяUTC(ПериодДата);
			Иначе
				Если НайтиПолейВМассиве(МассивПолей, СтрокаП) Тогда
					ЗначениеПоля = Строка(СтрокаР[СтрокаП]);
					//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 start
					ИндексДата = СтрНайти(ВРег(СтрокаП), ВРег("Дата"));
					Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Дата")
						ИЛИ (ИндексДата > 0 И ИндексДата < 5) Тогда
						
						ЗначениеСтроки = СтрокаР[СтрокаП];
						Если Строка(СтрокаР[СтрокаП]) = "" Тогда
							ЗначениеСтроки = Дата(1,1,1,0,0,0);	
						КонецЕсли;
						ЗначениеПоля = ПолучитьВремяUTC(ЗначениеСтроки);
						//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 17-11-2023 9:30 end
					ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Булево") Тогда
						ЗначениеПоля = Число(СтрокаР[СтрокаП]);
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ",", ".");
					ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Число") Тогда
						ЗначениеПоля = ВернутьЧислоБезПробелов(СокрЛП(СтрокаР[СтрокаП]));
						ЗначениеПоля = "'" + ЗначениеПоля + "'";
					ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Строка") Тогда
						ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
					Иначе
						Если СтрокаР[СтрокаП] <> NULL И СтрокаР[СтрокаП] <> Неопределено Тогда
							ТипЗначения = ТипЗнч(СтрокаР[СтрокаП]);
							ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
							Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
								ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
							ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
								ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
							Иначе
								ЗначениеПоля = "'0'";
							КонецЕсли;
						Иначе
							ЗначениеПоля = "'0'";
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					ЗначениеПоля = "'0'";
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	
		ТекстЗапросаПоля = ТекстЗапросаПоля + ЗначениеПоля;
		Если Счетчик <> КоличествоПолей Тогда
			ТекстЗапросаПоля = ТекстЗапросаПоля + ",";	
		КонецЕсли;
	КонецЦикла;
	ТекстЗапросаПоля = ТекстЗапросаПоля + ")";
	Возврат ТекстЗапросаПоля;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 05-11-2023 9:30 start

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start
Функция ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных = Неопределено, МассивПолей = Неопределено, МассивПолейЗапрос = Неопределено, ИндексацияТЗ = Неопределено, ЕстьРазница = Неопределено)
	ВставитьЗаписьВClickHouse_ПериодСхемаКомпоновкиДанных(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница);
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start
Процедура ВставитьЗаписьВClickHouse_ПериодСхемаКомпоновкиДанных(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница)
	ТекстДляЗапроса = ВернутьТекстЗапроса(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница);
	РезультатВыполненияЗапроса = ВыполнитьЗапросPOST_ClickHouse(ТекстДляЗапроса, Параметры);
	Ошибка = "";
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start
Функция ВернутьТекстЗапроса(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница)
	ТекстЗапроса = "INSERT INTO " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " (*)";
	ТекстЗапросаПоля = " VALUES " + ВернутьЗначенияЗапрос(СтрокаР, Параметры, ПериодДата, МассивПолей, МассивПолейЗапрос, ИндексацияТЗ, ЕстьРазница);
	Ошибка = "";
	ТекстДляЗапроса = ТекстЗапроса + " " + ТекстЗапросаПоля + ";";
	Возврат ТекстДляЗапроса;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  
						
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start										   
Функция ПолучитьВремяUTC(ПараметрДата) 
	
	ПериодДень = День(ПараметрДата);
	ПериодМесяц = Месяц(ПараметрДата);
	ПериодГод = Год(ПараметрДата);
	ПериодЧас = Час(ПараметрДата);
	ПериодМинута = Минута(ПараметрДата);
	ПериодСекунда = Секунда(ПараметрДата);
	
	Возврат "'" + ВернутьЧислоБезПробелов(ПериодГод, Истина) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодМесяц) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодДень) + " " + ВернутьЧислоБезПробеловСНулями(ПериодЧас) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодМинута) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодСекунда) + "'"; 
КонецФункции 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																					   
Функция ПолучитьUnixTS(ПараметрДата) 
	Возврат ВернутьЧислоБезПробелов(УниверсальноеВремя(ПараметрДата) - '19700101'); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																						
Функция ВернутьЧислоБезПробелов(ЧислоИзСтроки = 0, ЭтоГод = Ложь)
	Если ЭтоГод Тогда
		СтрокаЧисло = Формат(ЧислоИзСтроки, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0");
	Иначе
		СтрокаЧисло = Формат(ЧислоИзСтроки, "ЧН=0; ЧГ=0");
	КонецЕсли;
	
	СтрокаЧисло = Строка(СтрокаЧисло);
	СтрокаЧисло = СтрЗаменить(СтрокаЧисло, Символы.НПП, "");
	СтрокаЧисло = СтрЗаменить(СтрокаЧисло, ",", ".");

	Возврат СтрокаЧисло; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start
Функция ВернутьЧислоБезПробеловСНулями(ЧислоИзСтроки)
	Возврат Формат(ЧислоИзСтроки, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start	  
Функция НайтиПолейВМассиве(МассивП, Поле)
	Для каждого СтрокаМ из МассивП Цикл
		Если СтрокаМ = Поле Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start	 
Функция ВернутьМассивПорядокПериодИзРезультатаЗапроса(РезультатЗапроса)
	М = Новый Массив;
	ИмяПериод = "Период"; 	
	М.Добавить(ИмяПериод);
	Для каждого Колонка из РезультатЗапроса.Колонки Цикл
		М.Добавить(Колонка.Имя);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start																					   
Функция ВернутьМассивПорядокИзРезультатаЗапроса(РезультатЗапроса)
	М = Новый Массив;
	Для каждого Колонка из РезультатЗапроса.Колонки Цикл
		М.Добавить(Колонка.Имя);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
Функция ВернутьМассивПорядокПериодИзНабораДанных(ПоляНабораДанных)
	М = Новый Массив;
	ИмяПериод = "Период"; 	
	М.Добавить(ИмяПериод);
	Для каждого Поле из ПоляНабораДанных Цикл
		М.Добавить(Поле.Поле);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start			 
Функция ВернутьМассивПолейКлючейПериодИзНабораДанных(ПоляНабораДанных)
	М = Новый Массив;
	ИмяПериод = "Период"; 	
	М.Добавить(ИмяПериод);
	Для каждого ПолеНабора из ПоляНабораДанных Цикл
		Если ТипЗнч(ПолеНабора.ТипЗначения) = Тип("ОписаниеТипов") Тогда
			Если Строка(ПолеНабора.ТипЗначения) = "Число" Тогда
				//Возврат "Decimal64(10)";
			ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Дата" 
				И ПолеНабора.Поле = "Период" Тогда
				М.Добавить(ПолеНабора.Поле);
			ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Дата" Тогда
				//М.Добавить(ПолеНабора.Поле);
			ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Строка" Тогда
				М.Добавить(ПолеНабора.Поле);
			Иначе
				М.Добавить(ПолеНабора.Поле);
			КонецЕсли;
		Иначе
			М.Добавить(ПолеНабора.Поле);	
		КонецЕсли;
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
Функция ВернутьМассивПорядокИзНабораДанных(ПоляНабораДанных)
	М = Новый Массив;
	Для каждого Поле из ПоляНабораДанных Цикл
		М.Добавить(Поле.Поле);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																					
Функция ЕстьБазаВClickHouse(ИмяБазы, Параметры)
	Запрос = "SELECT name, comment FROM system.databases WHERE name = '" + Параметры.ИмяБазы + "';";
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+Запрос);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end
																				  
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start 
Функция ТекстЗапросаСозданиеБазыДанных(Параметры)
	Возврат "CREATE DATABASE " + Параметры.ИмяБазы + " COMMENT 'The Metrics database';";
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start									   
Функция ТекстЗапросаСозданиеТаблицыПериодСхемаКомпоновкиДанных(Параметры, ПараметрыМакета, ПоляМакета, ПоляКлючи)
	ТекстЗапроса = "CREATE TABLE " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + "";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + " (	" + Транслит("Период") + " Datetime,";
	Счетчик = 1;
	Количество = ПоляМакета.Количество();
	Для каждого ПолеМ из ПоляМакета Цикл
		Если Счетчик < Количество Тогда 
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " " + Транслит(ПолеМ.Поле) + " " + ПолучитьТипПоляНабора(ПолеМ) + ",";
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " " + Транслит(ПолеМ.Поле) + " " + ПолучитьТипПоляНабора(ПолеМ);
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ")";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ENGINE = ReplacingMergeTree";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "PRIMARY KEY (" + ПолучитьКлючИзМассива(ПоляКлючи) + ")";
	
	Возврат ТекстЗапроса;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start								  
Функция ПолучитьКлючИзМассива(МассивКлючей)
	КлючМ = Транслит(МассивКлючей[0]);
	Количество = МассивКлючей.Количество();
	Счетчик = 1;
	Для каждого КлючС из МассивКлючей Цикл
		Если Счетчик > 1 Тогда 
			КлючМ = КлючМ + "," + Транслит(КлючС);
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат КлючМ;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start								  
Функция ПолучитьТипПоляНабора(ПолеНабора)
	
	Если ТипЗнч(ПолеНабора.ТипЗначения) = Тип("ОписаниеТипов") Тогда
		Если Строка(ПолеНабора.ТипЗначения) = "Число" Тогда
			Возврат "Decimal64(10)";
		ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Дата" Тогда
			Возврат "Datetime";
		ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Строка" Тогда
			Возврат "String";
		Иначе
			Возврат "String";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "String";
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start									
Функция ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры)
	Запрос = ТекстЗапроса;
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	ФайлЗапроса = ПолучитьИмяВременногоФайла();
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.УстановитьТекст(Запрос);
	ТекстовыйФайл.Записать(ФайлЗапроса,КодировкаТекста.UTF8);
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.УстановитьИмяФайлаТела(ФайлЗапроса);
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "OK") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 start									
Функция ВыполнитьЗапросGET_ClickHouse(ТекстЗапроса, Параметры)
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+ТекстЗапроса);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Возврат ТекстОтвета; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 start									
Функция ЕстьТаблицаВClickHouse(ИмяТаблицы, Параметры)
	ТекстЗапроса = "SELECT * FROM " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " LIMIT 1;";
	//
	ТекстОтвета = ВыполнитьЗапросGET_ClickHouse(ТекстЗапроса, Параметры);
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 start									
Функция ОписаниеТаблицыВClickHouse(ИмяТаблицы, Параметры)
	ТекстЗапроса = "DESCRIBE TABLE " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит;
	//
	ТекстОтвета = ВыполнитьЗапросGET_ClickHouse(ТекстЗапроса, Параметры);
	МассивСтрок = СтрРазделитьРасширенная(ТекстОтвета, Символы.ПС);
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ИмяСКД", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ИндексСКД", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаМ из МассивСтрок Цикл
		Если СтрДлина(СтрокаМ) > 0 Тогда
			СтрокаТЗ = ТЗ.Добавить();
			РазделеннаяМ = СтрРазделитьРасширенная(СтрокаМ, Символы.Таб);
			СтрокаТЗ.Имя = РазделеннаяМ[0];
			СтрокаТЗ.Тип = РазделеннаяМ[1];
			СтрокаТЗ.ИмяСКД = "";
			СтрокаТЗ.ИндексСКД = -1;
		КонецЕсли;
	КонецЦикла;
	Возврат ТЗ;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 14-03-2024 18:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start										
Функция ЭтоОшибкаЗапросаClickHouse(ТекстОтвета)
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 32") Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти(ВРег(ТекстОтвета), "CODE: 57") Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти(ВРег(ТекстОтвета), "CODE: 62") Тогда
		Возврат Истина; 
	ИначеЕсли СтрНайти(ВРег(ТекстОтвета), "CODE: 60") Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти(ВРег(ТекстОтвета), "CODE: 36") Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти(ВРег(ТекстОтвета), "CODE:") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																					   
Функция Транслит(Строка) 
    
   Рез = СокрЛП(Строка);   
   Рез = СтрЗаменить(Рез,"а","a"); 
   Рез = СтрЗаменить(Рез,"б","b"); 
   Рез = СтрЗаменить(Рез,"в","v"); 
   Рез = СтрЗаменить(Рез,"г","g"); 
   Рез = СтрЗаменить(Рез,"д","d"); 
   Рез = СтрЗаменить(Рез,"е","e"); 
   Рез = СтрЗаменить(Рез,"ё","e"); 
   Рез = СтрЗаменить(Рез,"ж","zh"); 
   Рез = СтрЗаменить(Рез,"з","z"); 
   Рез = СтрЗаменить(Рез,"и","i"); 
   Рез = СтрЗаменить(Рез,"к","k"); 
   Рез = СтрЗаменить(Рез,"л","l"); 
   Рез = СтрЗаменить(Рез,"м","m"); 
   Рез = СтрЗаменить(Рез,"н","n"); 
   Рез = СтрЗаменить(Рез,"о","o"); 
   Рез = СтрЗаменить(Рез,"п","p"); 
   Рез = СтрЗаменить(Рез,"р","r"); 
   Рез = СтрЗаменить(Рез,"с","s"); 
   Рез = СтрЗаменить(Рез,"т","t"); 
   Рез = СтрЗаменить(Рез,"у","u"); 
   Рез = СтрЗаменить(Рез,"ф","f"); 
   Рез = СтрЗаменить(Рез,"х","h"); 
   Рез = СтрЗаменить(Рез,"ч","ch"); 
   Рез = СтрЗаменить(Рез,"ш","sh"); 
   Рез = СтрЗаменить(Рез,"щ","sch"); 
   Рез = СтрЗаменить(Рез,"ъ",""); 
   Рез = СтрЗаменить(Рез,"ь",""); 
   Рез = СтрЗаменить(Рез,"э","e"); 
   Рез = СтрЗаменить(Рез,"ю","yu"); 
   Рез = СтрЗаменить(Рез,"й","i"); 
   Рез = СтрЗаменить(Рез,"ц","c"); 
   Рез = СтрЗаменить(Рез,"я","ya"); 
   Рез = СтрЗаменить(Рез,"ы","i"); 
   Рез = СтрЗаменить(Рез,"А","A"); 
   Рез = СтрЗаменить(Рез,"Б","B"); 
   Рез = СтрЗаменить(Рез,"В","V"); 
   Рез = СтрЗаменить(Рез,"Г","G"); 
   Рез = СтрЗаменить(Рез,"Д","D"); 
   Рез = СтрЗаменить(Рез,"Е","E"); 
   Рез = СтрЗаменить(Рез,"Ё","E"); 
   Рез = СтрЗаменить(Рез,"Ж","ZH"); 
   Рез = СтрЗаменить(Рез,"З","Z"); 
   Рез = СтрЗаменить(Рез,"И","I"); 
   Рез = СтрЗаменить(Рез,"К","K"); 
   Рез = СтрЗаменить(Рез,"Л","L"); 
   Рез = СтрЗаменить(Рез,"М","M"); 
   Рез = СтрЗаменить(Рез,"Н","N"); 
   Рез = СтрЗаменить(Рез,"О","O"); 
   Рез = СтрЗаменить(Рез,"П","P"); 
   Рез = СтрЗаменить(Рез,"Р","R"); 
   Рез = СтрЗаменить(Рез,"С","S"); 
   Рез = СтрЗаменить(Рез,"Т","T"); 
   Рез = СтрЗаменить(Рез,"У","U"); 
   Рез = СтрЗаменить(Рез,"Ф","F"); 
   Рез = СтрЗаменить(Рез,"Х","H"); 
   Рез = СтрЗаменить(Рез,"Ч","CH"); 
   Рез = СтрЗаменить(Рез,"Ш","SH"); 
   Рез = СтрЗаменить(Рез,"Щ","SCH"); 
   Рез = СтрЗаменить(Рез,"Ъ",""); 
   Рез = СтрЗаменить(Рез,"Ь",""); 
   Рез = СтрЗаменить(Рез,"Ы","I"); 
   Рез = СтрЗаменить(Рез,"Ц","C"); 
   Рез = СтрЗаменить(Рез,"Э","E"); 
   Рез = СтрЗаменить(Рез,"Ю","YU"); 
   Рез = СтрЗаменить(Рез,"Я","YA"); 
   Рез = СтрЗаменить(Рез,"Й","I");
   
   Рез = СтрЗаменить(Рез," ","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"#",""); 
   Рез = СтрЗаменить(Рез,"№",""); 
   Рез = СтрЗаменить(Рез,",",""); 
   Рез = СтрЗаменить(Рез,".",""); 
   Рез = СтрЗаменить(Рез,"/",""); 
   Рез = СтрЗаменить(Рез,"""",""); 
   Рез = СтрЗаменить(Рез,"(",""); 
   Рез = СтрЗаменить(Рез,")",""); 
   
   Возврат(Рез);
  
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

Функция ПараметрыВыполненияВФоне(Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Результат = ОбщиеПараметрыВыполненияВФоне();
	ДобавитьПараметрыВыполненияДляВозвратаРезультата(Результат, ИдентификаторФормы);
	Результат.Вставить("ДополнительныйРезультат", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ОбщиеПараметрыВыполненияВФоне()
	
	Результат = Новый Структура;
	Результат.Вставить("ОжидатьЗавершение", ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 4, 0.8));
	Результат.Вставить("НаименованиеФоновогоЗадания", "");
	Результат.Вставить("КлючФоновогоЗадания", "");
	Результат.Вставить("ЗапуститьНеВФоне", Ложь);
	Результат.Вставить("ЗапуститьВФоне", Ложь);
	Результат.Вставить("БезРасширений", Ложь);
	Результат.Вставить("СРасширениямиБазыДанных", Ложь);
	Результат.Вставить("ПрерватьВыполнениеЕслиОшибка", Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьПараметрыВыполненияДляВозвратаРезультата(Параметры, ИдентификаторФормы)
	
	Параметры.Вставить("ИдентификаторФормы", ИдентификаторФормы); 
	Параметры.Вставить("АдресРезультата", Неопределено);
	
КонецПроцедуры
