//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним + " " + ЭтотОбъект.Метаданные().Комментарий; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета); 
	
	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", Синоним);
	РегистрационныеДанные.Вставить("Версия", "1.0.3");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Обработка "+Синоним); 
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, Синоним+" ручное", "Синхронизация1C_ClickHouse", "ОткрытиеФормы", Истина);
	ДобавитьКоманду(ТаблицаКоманд, "БросаниеВагоновТип фоновое", "Синхронизация1C_ClickHouseНаСервере_БросаниеВагоновТип" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетЛогисты фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетЛогисты" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОперативныйОтчетКоммерсанты фоновое", "Синхронизация1C_ClickHouseНаСервере_ОперативныйОтчетКоммерсанты" , "ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, "ОтчетСтранныеДвижения фоновое", "Синхронизация1C_ClickHouseНаСервере_ОтчетСтранныеДвижения" , "ВызовСерверногоМетода");
	
	// Сохраним таблицу команд в параметры регистрации обработки
	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start				
Функция ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт
	
	МассивПодстроки = СтрРазделить(ИдентификаторКоманды, "_");
	Если МассивПодстроки[1] = "ClickHouseНаСервере" Тогда  
		ПараметрыОбработки = ЗаполнитьПараметры();
		ПараметрыОбработки.Вставить("ИмяТаблицы", МассивПодстроки[2]);
		ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки, МассивПодстроки);
	КонецЕсли;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																		
Функция ЗаполнитьПараметры() Экспорт
	ТекущаяДата = ТекущаяДата();
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Адрес", "IP");
	СтруктураПараметры.Вставить("Порт", 8123);
	СтруктураПараметры.Вставить("Логин", "default");
	СтруктураПараметры.Вставить("Пароль", "password");
	СтруктураПараметры.Вставить("ИмяБазы", "db_name");
	СтруктураПараметры.Вставить("ИмяТаблицы", "БросаниеВагоновТип");
	
	СтруктураПараметры.Вставить("ДатаНачала", ДатаДнейНазад(ТекущаяДата, 1));
	СтруктураПараметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата));
	Возврат СтруктураПараметры;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		
Функция ПолучитьТаблицуКоманд()
 
     Команды = Новый ТаблицаЗначений;
     Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
     Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
     Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
     Возврат Команды;
 
 КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end
 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
 
      НоваяКоманда = ТаблицаКоманд.Добавить();
      НоваяКоманда.Представление = Представление;
      НоваяКоманда.Идентификатор = Идентификатор;
      НоваяКоманда.Использование = Использование;
      НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
      НоваяКоманда.Модификатор = Модификатор;
 
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start			
Процедура ВыгрузитьДанныеClickHouseНаСервере(Параметры, МассивПодстроки = Неопределено) Экспорт
	
	//
	Если Не ЕстьБазаВClickHouse(Параметры.ИмяБазы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеБазыДанных(Параметры);
		БазаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	Параметры.Вставить("ИмяТаблицыТранслит", Транслит(Параметры.ИмяТаблицы));
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
	//
	ПараметрыЗапроса = ПолучитьСтруктуруПараметровЗапроса(Параметры);
	//
	Если Параметры.ИмяТаблицы = "БросаниеВагоновТип" Тогда
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		//
		Запрос.УстановитьПараметр("ВключитьОтборТолькоБросание", Истина);
		//
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);
	КонецЕсли;
	Если Параметры.ИмяТаблицы = "ОперативныйОтчетЛогисты" Тогда
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);
	КонецЕсли;
	Если Параметры.ИмяТаблицы = "ОперативныйОтчетКоммерсанты" Тогда
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);
	КонецЕсли;
	Если Параметры.ИмяТаблицы = "ОтчетСтранныеДвижения" Тогда
		Запрос = УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса);
		ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end		

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		
Функция ПолучитьКлючиClickHouse_ОперативныйОтчетЛогисты()
	М = Новый Массив;
	М.Добавить("Период");
	М.Добавить("СтанцияОтправленияНаименование");
	М.Добавить("ТипТСНаименование");
	М.Добавить("ТипФильтра");
	М.Добавить("СтанцияНазначения");
	М.Добавить("ГрузополучательНаименование");
	М.Добавить("СтанцияНазначенияНаименование");
	М.Добавить("НомерКонтейнера");
	М.Добавить("ГрузоотправительКодПоОКПО");
	М.Добавить("ОператорПоДоверенности");
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		
Функция ВернутьДату_Запрос_НаСервере(ИмяПоля, ПериодОтчета, НоваяДатаОтчета)
	Если ИмяПоля = "Дата1" Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "Дата2" Тогда
		Возврат КонецМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчета" Тогда
		Возврат ПериодОтчета;
	КонецЕсли;
	Если ИмяПоля = "Период" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
	Если ИмяПоля = "ПериодОтчета" Тогда
		Возврат НачалоДня(ПериодОтчета);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
	Если ИмяПоля = "ДатаПланНачало" Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаПланКонец" Тогда
		Возврат КонецДня(ДатаДнейНазад(ПериодОтчета, 1));
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетБаланс" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетЗаказ" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетПоОперациямОтбор" Тогда
		Возврат НачалоДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправление3" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправлениеТолько" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ТекущаяДатаОтчетСводноОтправлениеНазначение3" Тогда
		Возврат КонецДня(НоваяДатаОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаДислокацияПогружено1" Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если ИмяПоля = "ДатаДислокацияПогружено2" Тогда
		Возврат КонецМесяца(ПериодОтчета);
	КонецЕсли;
	
	
	Если СтрНайти(ИмяПоля, "Период") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Текущая") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Дата1") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Начало") > 0 Тогда
		Возврат НачалоМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Дата2") > 0 Тогда
		Возврат КонецМесяца(ПериодОтчета);
	КонецЕсли;
	Если СтрНайти(ИмяПоля, "Конец") > 0 Тогда
		Возврат КонецМесяца(ПериодОтчета);
	КонецЕсли;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																					
Функция ПолучитьСтруктуруПараметровЗапроса(Параметры)
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Запрос"+Параметры.ИмяТаблицы);
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	//
	ПараметрыМакета = СхемаКомпоновкиДанных.Параметры;
	ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	МассивПолей = ВернутьМассивПорядокПериодИзНабораДанных(ПоляНабораДанных);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
	КоличествоДнейНазад = ПолучитьПараметрМакетаПоИмени("КоличествоДнейНазад", ПараметрыМакета);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
	
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start																				 
	Возврат Новый Структура("Запрос, ПараметрыМакета, ПоляНабораДанных, МассивПолей, КоличествоДнейНазад", Запрос, ПараметрыМакета, ПоляНабораДанных, МассивПолей, КоличествоДнейНазад);
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
Функция ПолучитьПараметрМакетаПоИмени(ИмяПараметра, ПараметрыМакета)
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если СтрокаПараметра.Имя = ИмяПараметра Тогда
			Возврат СтрокаПараметра.Значение;
		КонецЕсли;
	КонецЦикла; 
	Если ИмяПараметра = "КоличествоДнейНазад" Тогда
		Возврат 1;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start
Функция УстановитьПараметрыЗапросаПоУмолчанию(Параметры, ПараметрыЗапроса)
	
	Запрос = ПараметрыЗапроса.Запрос;
	ПараметрыМакета = ПараметрыЗапроса.ПараметрыМакета;
	ПоляНабораДанных = ПараметрыЗапроса.ПоляНабораДанных;
	МассивПолей = ПараметрыЗапроса.МассивПолей;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
	//
												
   
	Если Не ЕстьТаблицаВClickHouse(Параметры.ИмяТаблицы, Параметры) Тогда
		ТекстЗапроса = ТекстЗапросаСозданиеТаблицыПериодСхемаКомпоновкиДанных(Параметры, ПараметрыМакета, ПоляНабораДанных, МассивПолей);
		ТаблицаСоздана = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры);
	КонецЕсли;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 start
	Для каждого СтрокаПараметра из ПараметрыМакета Цикл
		Если ТипЗнч(СтрокаПараметра.ТипЗначения) = Тип("ОписаниеТипов") Тогда
			Если Строка(СтрокаПараметра.ТипЗначения) = "Стандартный период" Тогда				
				ДатаНачала = ВернутьДату_Запрос_НаСервере("Начало", Параметры.ДатаНачала, Параметры.ДатаНачала);
				ДатаОкончания = ВернутьДату_Запрос_НаСервере("Конец", Параметры.ДатаНачала, Параметры.ДатаНачала);
                СтрокаПараметра.Значение = Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
			ИначеЕсли Строка(СтрокаПараметра.ТипЗначения) = "Дата" Тогда
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, ВернутьДату_Запрос_НаСервере(СтрокаПараметра.Имя, Параметры.ДатаНачала, Параметры.ДатаНачала));
			Иначе
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 03-11-2023 9:30 end
	Возврат Запрос;
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end
																				  			//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Процедура ВыгрузитьДанныеClickHouse_Запрос_НаСервере(Запрос, Параметры, ПараметрыЗапроса)
	
	ПараметрыМакета = ПараметрыЗапроса.ПараметрыМакета;
	ПоляНабораДанных = ПараметрыЗапроса.ПоляНабораДанных;
	МассивПолей = ПараметрыЗапроса.МассивПолей;
	//
	Если Параметры.КоличествоДнейНазад > 0 Тогда

		НоваяДатаОтчета = НачалоДня(Параметры.ДатаНачала);
		Для Счетчик = 1 По Параметры.КоличествоДнейНазад + 1 Цикл
			//
			Для каждого СтрокаПараметра из ПараметрыМакета Цикл
				Если ТипЗнч(СтрокаПараметра.ТипЗначения) = Тип("ОписаниеТипов") Тогда
					Если Строка(СтрокаПараметра.ТипЗначения) = "Стандартный период" Тогда
						ДатаНачала = ВернутьДату_Запрос_НаСервере("Начало", НоваяДатаОтчета, НоваяДатаОтчета);
						ДатаОкончания = ВернутьДату_Запрос_НаСервере("Конец", НоваяДатаОтчета, НоваяДатаОтчета);
                        СтрокаПараметра.Значение = Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
						Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
					ИначеЕсли Строка(СтрокаПараметра.ТипЗначения) = "Дата" Тогда
						Запрос.УстановитьПараметр(СтрокаПараметра.Имя, ВернутьДату_Запрос_НаСервере(СтрокаПараметра.Имя, НоваяДатаОтчета, НоваяДатаОтчета));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, НоваяДатаОтчета, ПоляНабораДанных, МассивПолей);
			//
			НоваяДатаОтчета = ДатаДнейВперед(НоваяДатаОтчета, 1);
			//НоваяДатаОтчета = НачалоДня(НоваяДатаОтчета) + 60 * 60 * 24;
		КонецЦикла;
	Иначе
		ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, Параметры.ДатаНачала, ПоляНабораДанных, МассивПолей);
	КонецЕсли;	 
	
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start																				
Функция ДатаДнейВперед(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) + 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ДатаДнейНазад(ДатаНачала, КоличествоДней)
	Возврат НачалоДня(ДатаНачала) - 60 * 60 * 24 * КоличествоДней; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция РозностьВДнях(ДатаОкончания, ДатаНачала)
	Возврат (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		
Процедура ЗаписатьРезультатЗапросаClickHouseНаСервере(Запрос, Параметры, ПериодДата, ПоляНабораДанных = Неопределено, МассивПолей = Неопределено)
	РезультатЗапроса = Запрос.Выполнить();
	МассивПолейЗапрос = ВернутьМассивПорядокПериодИзРезультатаЗапроса(РезультатЗапроса);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	//
	ВыборкаРезультата = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Для каждого СтрокаР из ВыборкаРезультата Цикл
		ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос);	
	КонецЦикла;
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ВставитьЗаписьВClickHouse(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных = Неопределено, МассивПолей = Неопределено, МассивПолейЗапрос = Неопределено)
	Если Параметры.ИмяТаблицы = "БросаниеВагоновТип" Тогда
		ВставитьЗаписьВClickHouse_БросаниеВагоновТип(СтрокаР, Параметры, ПериодДата);
	Иначе
		ВставитьЗаписьВClickHouse_ПериодСхемаКомпоновкиДанных(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос);	
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:3 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start			
Процедура ВставитьЗаписьВClickHouse_ПериодСхемаКомпоновкиДанных(СтрокаР, Параметры, ПериодДата, ПоляНабораДанных, МассивПолей, МассивПолейЗапрос)
	КоличествоПолей = МассивПолей.Количество();
	Счетчик = 0;
	ТекстЗапроса = "INSERT INTO " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " (*)";
	ТекстЗапросаПоля = "VALUES (";
	Для каждого СтрокаП из МассивПолей Цикл
		Счетчик = Счетчик + 1;
		ЗначениеПоля = Неопределено;
		Если ВРег(СтрокаП) = ВРег("Период") > 0 Тогда
			ЗначениеПоля = ПолучитьВремяUTC(ПериодДата);
		Иначе
			Если НайтиПолейВМассиве(МассивПолейЗапрос, СтрокаП) Тогда
				ЗначениеПоля = Строка(СтрокаР[СтрокаП]);
				Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Дата") Тогда
					ЗначениеПоля = ПолучитьВремяUTC(СтрокаР[СтрокаП]);
				ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Булево") Тогда
					ЗначениеПоля = Число(СтрокаР[СтрокаП]);
					ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ",", ".");
				ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Число") Тогда
					ЗначениеПоля = ВернутьЧислоБезПробелов(СокрЛП(СтрокаР[СтрокаП]));
					ЗначениеПоля = "'" + ЗначениеПоля + "'";
				ИначеЕсли ТипЗнч(СтрокаР[СтрокаП]) = Тип("Строка") Тогда
					ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
				Иначе
					Если СтрокаР[СтрокаП] <> NULL И СтрокаР[СтрокаП] <> Неопределено Тогда
						ТипЗначения = ТипЗнч(СтрокаР[СтрокаП]);
						ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
						Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
						    ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
						ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
						    ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
						Иначе
							ЗначениеПоля = "'0'";
						КонецЕсли;
					Иначе
						ЗначениеПоля = "'0'";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				ЗначениеПоля = "'0'";
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстЗапросаПоля = ТекстЗапросаПоля + ЗначениеПоля;
		Если Счетчик <> КоличествоПолей Тогда
			ТекстЗапросаПоля = ТекстЗапросаПоля + ",";	
		КонецЕсли;
	КонецЦикла;
	ТекстЗапросаПоля = ТекстЗапросаПоля + ")";
	Ошибка = "";
	РезультатВыполненияЗапроса = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса + " " + ТекстЗапросаПоля, Параметры);
	Ошибка = "";
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Процедура ВставитьЗаписьВClickHouse_БросаниеВагоновТип(СтрокаР, Параметры, ПериодДата)
	МассивПолей = ВернутьМассивПорядокПолейВClickHouse_БросаниеВагоновТип();
	КоличествоПолей = МассивПолей.Количество();
	Счетчик = 0;
	ТекстЗапроса = "INSERT INTO " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " (*)";
	ТекстЗапросаПоля = "VALUES (";
	Для каждого СтрокаП из МассивПолей Цикл
		Счетчик = Счетчик + 1;
		ЗначениеПоля = Строка(СтрокаР[СтрокаП]);
		Если СтрНайти(ВРег(СтрокаП), ВРег("Период")) > 0 Тогда
			//ЗначениеПоля = ПолучитьUnixTS(НачалоДня(СтрокаР[СтрокаП]));
			ЗначениеПоля = ПолучитьВремяUTC(ПериодДата);
			//ЗначениеПоля = ПолучитьВремяUTC(НачалоДня(СтрокаР[СтрокаП]));
		КонецЕсли;
		Если СтрНайти(ВРег(СтрокаП), ВРег("Дата")) > 0 Тогда
			//ЗначениеПоля = ПолучитьUnixTS(СтрокаР[СтрокаП]);
			ЗначениеПоля = ПолучитьВремяUTC(СтрокаР[СтрокаП]);
		КонецЕсли;
		Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Число") Тогда
			ЗначениеПоля = СокрЛП(СтрокаР[СтрокаП]);
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ",", ".");
		КонецЕсли;
		Если ТипЗнч(СтрокаР[СтрокаП]) = Тип("Строка") Тогда
			ЗначениеПоля = "'" + СокрЛП(СтрокаР[СтрокаП]) + "'";
		КонецЕсли;
		ТекстЗапросаПоля = ТекстЗапросаПоля + ЗначениеПоля;
		Если Счетчик <> КоличествоПолей Тогда
			ТекстЗапросаПоля = ТекстЗапросаПоля + ",";	
		КонецЕсли;
	КонецЦикла;
	ТекстЗапросаПоля = ТекстЗапросаПоля + ")";
	Ошибка = "";
	РезультатВыполненияЗапроса = ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса + " " + ТекстЗапросаПоля, Параметры);
	Ошибка = "";
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ПолучитьВремяUTC(ПараметрДата) 
	ПериодДень = День(ПараметрДата);
	ПериодМесяц = Месяц(ПараметрДата);
	ПериодГод = Год(ПараметрДата);
	ПериодЧас = Час(ПараметрДата);
	ПериодМинута = Минута(ПараметрДата);
	ПериодСекунда = Секунда(ПараметрДата);
	Возврат "'" + ВернутьЧислоБезПробелов(ПериодГод) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодМесяц) + "-" + ВернутьЧислоБезПробеловСНулями(ПериодДень) + " " + ВернутьЧислоБезПробеловСНулями(ПериодЧас) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодМинута) + ":" + ВернутьЧислоБезПробеловСНулями(ПериодСекунда) + "'"; 
КонецФункции 
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start	
Функция ПолучитьUnixTS(ПараметрДата) 
	Возврат ВернутьЧислоБезПробелов(УниверсальноеВремя(ПараметрДата) - '19700101'); 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		
Функция ВернутьЧислоБезПробелов(ЧислоИзСтроки)
	СтрокаЧисло = Формат(ЧислоИзСтроки, "ЧН=0; ЧГ=0");
	СтрокаЧисло = Строка(СтрокаЧисло);
	СтрокаЧисло = СтрЗаменить(СтрокаЧисло, Символы.НПП, "");
	СтрокаЧисло = СтрЗаменить(СтрокаЧисло, ",", ".");

	Возврат СтрокаЧисло; 
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start			
Функция ВернутьЧислоБезПробеловСНулями(ЧислоИзСтроки)
	Возврат Формат(ЧислоИзСтроки, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start			
Функция НайтиПолейВМассиве(МассивП, Поле)
	Для каждого СтрокаМ из МассивП Цикл
		Если СтрокаМ = Поле Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start			
Функция ВернутьМассивПорядокПериодИзРезультатаЗапроса(РезультатЗапроса)
	М = Новый Массив;
	ИмяПериод = "Период"; 	
	М.Добавить(ИмяПериод);
	Для каждого Колонка из РезультатЗапроса.Колонки Цикл
		М.Добавить(Колонка.Имя);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start	   
Функция ВернутьМассивПорядокИзРезультатаЗапроса(РезультатЗапроса)
	М = Новый Массив;
	Для каждого Колонка из РезультатЗапроса.Колонки Цикл
		М.Добавить(Колонка.Имя);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start			
Функция ВернутьМассивПорядокПериодИзНабораДанных(ПоляНабораДанных)
	М = Новый Массив;
	ИмяПериод = "Период"; 	
	М.Добавить(ИмяПериод);
	Для каждого Поле из ПоляНабораДанных Цикл
		М.Добавить(Поле.Поле);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start			
Функция ВернутьМассивПорядокИзНабораДанных(ПоляНабораДанных)
	М = Новый Массив;
	Для каждого Поле из ПоляНабораДанных Цикл
		М.Добавить(Поле.Поле);
	КонецЦикла;
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		 
Функция ВернутьМассивПорядокПолейВClickHouse_БросаниеВагоновТип()
	М = Новый Массив;
	М.Добавить("Период");
	М.Добавить("РПС");
	М.Добавить("ТипСобственности");
	М.Добавить("НомерКонтейнера");
	М.Добавить("стДислокации");
	М.Добавить("ДатаОперации");
	М.Добавить("ДнейБезДвижения");
	М.Добавить("КоличествоТС");
	Возврат М;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start	   
Функция ЕстьБазаВClickHouse(ИмяБазы, Параметры)
	Запрос = "SELECT name, comment FROM system.databases WHERE name = '" + Параметры.ИмяБазы + "';";
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+Запрос);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start			
Функция ТекстЗапросаСозданиеБазыДанных(Параметры)
	Возврат "CREATE DATABASE " + Параметры.ИмяБазы + " COMMENT 'The Metrics database';";
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		
Функция ТекстЗапросаСозданиеТаблицыПериодСхемаКомпоновкиДанных(Параметры, ПараметрыМакета, ПоляМакета, ПоляКлючи)
	ТекстЗапроса = "CREATE TABLE " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + "";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + " (	" + Транслит("Период") + " Datetime,";
	Счетчик = 1;
	Количество = ПоляМакета.Количество();
	Для каждого ПолеМ из ПоляМакета Цикл
		Если Счетчик < Количество Тогда 
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " " + Транслит(ПолеМ.Поле) + " " + ПолучитьТипПоляНабора(ПолеМ) + ",";
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " " + Транслит(ПолеМ.Поле) + " " + ПолучитьТипПоляНабора(ПолеМ);
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ")";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ENGINE = ReplacingMergeTree";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "PRIMARY KEY (" + ПолучитьКлючИзМассива(ПоляКлючи) + ")";
	
	Возврат ТекстЗапроса;	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		
Функция ПолучитьКлючИзМассива(МассивКлючей)
	КлючМ = Транслит(МассивКлючей[0]);
	Количество = МассивКлючей.Количество();
	Счетчик = 1;
	Для каждого КлючС из МассивКлючей Цикл
		Если Счетчик > 1 Тогда 
			КлючМ = КлючМ + "," + Транслит(КлючС);
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат КлючМ;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 start		 
Функция ПолучитьТипПоляНабора(ПолеНабора)
	
	Если ТипЗнч(ПолеНабора.ТипЗначения) = Тип("ОписаниеТипов") Тогда
		Если Строка(ПолеНабора.ТипЗначения) = "Число" Тогда
			Возврат "Decimal64(10)";
		ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Дата" Тогда
			Возврат "Datetime";
		ИначеЕсли Строка(ПолеНабора.ТипЗначения) = "Строка" Тогда
			Возврат "String";
		Иначе
			Возврат "String";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "String";
	
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 01-11-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ТекстЗапросаСозданиеТаблицыБросаниеВагоновТип(Параметры)
	Возврат "CREATE TABLE " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + "
	|(	Period Datetime,
	|	Type String,
	|	PropertyType String,
	|	Number String,
	|	Station String,
	|	Date Datetime,
	|	Days Decimal64(10),
	|	Count UInt32
	|)
	|ENGINE = ReplacingMergeTree
	|PRIMARY KEY (Period, Number)";
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ВыполнитьЗапросPOST_ClickHouse(ТекстЗапроса, Параметры)
	Запрос = ТекстЗапроса;
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	ФайлЗапроса = ПолучитьИмяВременногоФайла();
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.УстановитьТекст(Запрос);
	ТекстовыйФайл.Записать(ФайлЗапроса,КодировкаТекста.UTF8);
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.УстановитьИмяФайлаТела(ФайлЗапроса);
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "OK") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ЕстьТаблицаВClickHouse(ИмяТаблицы, Параметры)
	Запрос = "SELECT * FROM " + Параметры.ИмяБазы +"." + Параметры.ИмяТаблицыТранслит + " LIMIT 1;";
	//
	Соединение = Новый HttpСоединение(Параметры.Адрес, Параметры.Порт, Параметры.Логин, Параметры.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос("?query="+Запрос);
	Результат = Соединение.Получить(HTTPЗапрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	Если ЭтоОшибкаЗапросаClickHouse(ТекстОтвета) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекстОтвета <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start		 
Функция ЭтоОшибкаЗапросаClickHouse(ТекстОтвета)
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 32") Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 57") Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 62") Тогда
		Возврат Истина; 
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 60") Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(ТекстОтвета), "CODE: 36") Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 start	 
Функция Транслит(Строка) 
    
   Рез = СокрЛП(Строка);   
   Рез = СтрЗаменить(Рез,"а","a"); 
   Рез = СтрЗаменить(Рез,"б","b"); 
   Рез = СтрЗаменить(Рез,"в","v"); 
   Рез = СтрЗаменить(Рез,"г","g"); 
   Рез = СтрЗаменить(Рез,"д","d"); 
   Рез = СтрЗаменить(Рез,"е","e"); 
   Рез = СтрЗаменить(Рез,"ё","e"); 
   Рез = СтрЗаменить(Рез,"ж","zh"); 
   Рез = СтрЗаменить(Рез,"з","z"); 
   Рез = СтрЗаменить(Рез,"и","i"); 
   Рез = СтрЗаменить(Рез,"к","k"); 
   Рез = СтрЗаменить(Рез,"л","l"); 
   Рез = СтрЗаменить(Рез,"м","m"); 
   Рез = СтрЗаменить(Рез,"н","n"); 
   Рез = СтрЗаменить(Рез,"о","o"); 
   Рез = СтрЗаменить(Рез,"п","p"); 
   Рез = СтрЗаменить(Рез,"р","r"); 
   Рез = СтрЗаменить(Рез,"с","s"); 
   Рез = СтрЗаменить(Рез,"т","t"); 
   Рез = СтрЗаменить(Рез,"у","u"); 
   Рез = СтрЗаменить(Рез,"ф","f"); 
   Рез = СтрЗаменить(Рез,"х","h"); 
   Рез = СтрЗаменить(Рез,"ч","ch"); 
   Рез = СтрЗаменить(Рез,"ш","sh"); 
   Рез = СтрЗаменить(Рез,"щ","sch"); 
   Рез = СтрЗаменить(Рез,"ъ",""); 
   Рез = СтрЗаменить(Рез,"ь",""); 
   Рез = СтрЗаменить(Рез,"э","e"); 
   Рез = СтрЗаменить(Рез,"ю","yu"); 
   Рез = СтрЗаменить(Рез,"й","i"); 
   Рез = СтрЗаменить(Рез,"ц","c"); 
   Рез = СтрЗаменить(Рез,"я","ya"); 
   Рез = СтрЗаменить(Рез,"ы","i"); 
   Рез = СтрЗаменить(Рез,"А","A"); 
   Рез = СтрЗаменить(Рез,"Б","B"); 
   Рез = СтрЗаменить(Рез,"В","V"); 
   Рез = СтрЗаменить(Рез,"Г","G"); 
   Рез = СтрЗаменить(Рез,"Д","D"); 
   Рез = СтрЗаменить(Рез,"Е","E"); 
   Рез = СтрЗаменить(Рез,"Ё","E"); 
   Рез = СтрЗаменить(Рез,"Ж","ZH"); 
   Рез = СтрЗаменить(Рез,"З","Z"); 
   Рез = СтрЗаменить(Рез,"И","I"); 
   Рез = СтрЗаменить(Рез,"К","K"); 
   Рез = СтрЗаменить(Рез,"Л","L"); 
   Рез = СтрЗаменить(Рез,"М","M"); 
   Рез = СтрЗаменить(Рез,"Н","N"); 
   Рез = СтрЗаменить(Рез,"О","O"); 
   Рез = СтрЗаменить(Рез,"П","P"); 
   Рез = СтрЗаменить(Рез,"Р","R"); 
   Рез = СтрЗаменить(Рез,"С","S"); 
   Рез = СтрЗаменить(Рез,"Т","T"); 
   Рез = СтрЗаменить(Рез,"У","U"); 
   Рез = СтрЗаменить(Рез,"Ф","F"); 
   Рез = СтрЗаменить(Рез,"Х","H"); 
   Рез = СтрЗаменить(Рез,"Ч","CH"); 
   Рез = СтрЗаменить(Рез,"Ш","SH"); 
   Рез = СтрЗаменить(Рез,"Щ","SCH"); 
   Рез = СтрЗаменить(Рез,"Ъ",""); 
   Рез = СтрЗаменить(Рез,"Ь",""); 
   Рез = СтрЗаменить(Рез,"Ы","I"); 
   Рез = СтрЗаменить(Рез,"Ц","C"); 
   Рез = СтрЗаменить(Рез,"Э","E"); 
   Рез = СтрЗаменить(Рез,"Ю","YU"); 
   Рез = СтрЗаменить(Рез,"Я","YA"); 
   Рез = СтрЗаменить(Рез,"Й","I");
   
   Рез = СтрЗаменить(Рез," ","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"#",""); 
   Рез = СтрЗаменить(Рез,"№",""); 
   Рез = СтрЗаменить(Рез,",",""); 
   Рез = СтрЗаменить(Рез,".",""); 
   Рез = СтрЗаменить(Рез,"/",""); 
   Рез = СтрЗаменить(Рез,"""",""); 
   Рез = СтрЗаменить(Рез,"(",""); 
   Рез = СтрЗаменить(Рез,")",""); 
   
   Возврат(Рез);
  
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 27-10-2023 9:30 end																				  