&НаСервере
Процедура ВыполнитьВыгрузкуДанныхClickHouseНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеПростоиПоТипам(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "БросаниеВагоновТип");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетЛогисты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетЛогисты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКоммерсанты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКоммерсанты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтранныеДвижения(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОтчетСтранныеДвижения");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);

	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЭкономикеИСтатистикеРейсов(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОтчетПоЭкономикеИСтатистикеРейсов");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбест(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныАсбест");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНеНаСтанцииДиспетчерKPI(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеНеНаСтанцииДиспетчерKPI");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНаСтанцииДиспетчерKPI(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеНаСтанцииДиспетчерKPI");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеДиспетчерKPI(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеДиспетчерKPI");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагоновСрезПоследних(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ДислокацияВагоновСрезПоследних");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагонов(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ДислокацияВагонов");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры
