&НаСервере
Процедура ВыполнитьВыгрузкуДанныхClickHouseНаСервере(СтруктураПараметрыФормы)
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	Для каждого Элемент из СтруктураПараметрыФормы Цикл
		ПараметрыОбработки.Вставить(Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
	//
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеПростоиПоТипам(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетЛогисты(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКоммерсанты(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтранныеДвижения(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЭкономикеИСтатистикеРейсов(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбест(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНеНаСтанцииДиспетчер(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНаСтанцииДиспетчер(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеДиспетчер(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагоновСрезПоследних(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагонов(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбестV2(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныДжабыкV2(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОтчетДислокацииДляЛогистаИМенеджера(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбестV28(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныДжабыкV28(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры(Команда)
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ЗаполенитьСтруктуруПараметровИзФормы());
КонецПроцедуры

&НаКлиенте
Функция ЗаполенитьСтруктуруПараметровИзФормы()
	СтруктураПараметрыФормы = Новый Структура;
	//СтруктураПараметрыФормы.Вставить("Адрес", Объект.Адрес);
	СтруктураПараметрыФормы.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры");	
	СтруктураПараметрыФормы.Вставить("ДатаНачала", Период.ДатаНачала);
	СтруктураПараметрыФормы.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	Возврат СтруктураПараметрыФормы;
КонецФункции
