&НаСервере
Процедура ВыгрузитьДанныеClickHouseНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеПростоиПоТипам(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "БросаниеВагоновТип");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросОперативныйОтчетЛогистыНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетЛогисты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетЛогисты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ЗапросОперативныйОтчетЛогистыНаСервере(ПараметрыОбработки);
КонецПроцедуры
