&НаСервере
Процедура ВыполнитьВыгрузкуДанныхClickHouseНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеПростоиПоТипам(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "БросаниеВагоновТип");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетЛогисты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетЛогисты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКоммерсанты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКоммерсанты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтранныеДвижения(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОтчетСтранныеДвижения");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);

	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЭкономикеИСтатистикеРейсов(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОтчетПоЭкономикеИСтатистикеРейсов");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбест(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныАсбест");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНеНаСтанцииДиспетчер(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеНеНаСтанцииДиспетчер");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеНаСтанцииДиспетчер(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеНаСтанцииДиспетчер");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПростоиИБросаниеДиспетчер(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ПростоиИБросаниеДиспетчер");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагоновСрезПоследних(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ДислокацияВагоновСрезПоследних");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДислокацияВагонов(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ДислокацияВагонов");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбестV2(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныАсбестV2");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныДжабыкV2(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныДжабыкV2");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОтчетДислокацииДляЛогистаИМенеджера(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОтчетДислокацииДляЛогистаИМенеджера");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныАсбестV28(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныАсбестV28");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентаВагоныДжабыкV28(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентаВагоныДжабыкV28");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	//ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетКлиентыКоммерсантыЛогистыДиспетчеры");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ВыполнитьВыгрузкуДанныхClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры
