//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаСервере
Процедура ВыгрузитьДанныеClickHouseНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаСервере
Функция ПолучитьСтруктуруПараметров()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьПараметры();
КонецФункции
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаКлиенте
Процедура ВыгрузитьДанныеПростоиПоТипам(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "БросаниеВагоновТип");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ВыгрузитьДанныеClickHouseНаСервере(ПараметрыОбработки);
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяДата = ТекущаяДата();
	Период.ДатаНачала = НачалоДня(ТекущаяДата);
	Период.ДатаОкончания = КонецДня(ТекущаяДата);
	//ПриОткрытииНаСервере();
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаСервере
Процедура ЗапросОперативныйОтчетЛогистыНаСервере(Параметры)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеClickHouseНаСервере(Параметры);
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end

//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 start
&НаКлиенте
Процедура ЗапросОперативныйОтчетЛогисты(Команда)
	СтруктураПараметры = Новый Структура;
	ПараметрыОбработки = ПолучитьСтруктуруПараметров();
	ПараметрыОбработки.Вставить("Адрес", Объект.Адрес);
	ПараметрыОбработки.Вставить("ИмяТаблицы", "ОперативныйОтчетЛогисты");	
	ПараметрыОбработки.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ЗапросОперативныйОтчетЛогистыНаСервере(ПараметрыОбработки);
КонецПроцедуры
//<<%%>> ilya@kimkarus.ru @kimkarus kimkarus.ru # Ilya Kosarev 10-07-2023 9:30 end